---
type: StructuralSectionCProfile
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionCProfile

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfile` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionCProfile | 2016 | `public StructuralSectionCProfile ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double centroidHorizontal , double centroidVertical , double principalAxes` |